PUNteerased/Khrong-ngan/hardware/esp32-s3-laneya-kiosk/arduino-ide/esp32-s3-laneya-kiosk/esp32-s3-laneya-kiosk.ino
/*
 * LaneYa — ESP32-S3 Kiosk (Arduino IDE)
 *
 * Libraries (Arduino IDE → Library Manager):
 *   - ArduinoJson
 *   - Adafruit PWM Servo Driver Library
 *   - Adafruit BusIO
 *
 * Tools → Board: ESP32S3 Dev Module, Flash 16MB, PSRAM OPI, USB CDC On Boot Enabled
 * Serial Monitor: 115200 — ดู [web-cmd] เมื่อ Admin ส่งคำสั่งจากเว็บ
 */

// ============ CONFIG — แก้ก่อน upload ============
#define WIFI_SSID "SAENEE UNTA 2.4G"
#define WIFI_PASSWORD "0819534686"

#define KIOSK_LAT 17.0147929
#define KIOSK_LNG 99.820863
#define KIOSK_NAME "LaneYa Kiosk"

#define BACKEND_HEARTBEAT_URL "https://khrong-ngan.onrender.com/api/kiosk/heartbeat"
#define BACKEND_SESSION_SYNC_URL "https://khrong-ngan.onrender.com/api/kiosk/session-sync"
#define BACKEND_REDEEM_URL "https://khrong-ngan.onrender.com/api/kiosk/redeem-ticket"
#define BACKEND_PREVIEW_URL "https://khrong-ngan.onrender.com/api/kiosk/preview-ticket"
#define BACKEND_CAMERA_FRAME_URL "https://khrong-ngan.onrender.com/api/kiosk/camera-frame"
#define KIOSK_HEARTBEAT_SECRET "ilovevijai"

#define FIRMWARE_VERSION "1.0.0-kiosk"
// รับคำสั่ง Admin เร็วขึ้น — ESP32 ดึง command ทุกครั้งที่ POST heartbeat นี้
// production อาจใช้ 15000–30000 ถ้าไม่อยากยิง Render บ่อย
#define HEARTBEAT_INTERVAL_MS 5000
#define HEARTBEAT_ACTIVE_INTERVAL_MS 2500
#define CAMERA_FRAME_INTERVAL_MS 500

#define I2C_SDA_PIN 9
#define I2C_SCL_PIN 10
#define PCA9685_I2C_ADDR 0x40
#define DISPENSER_SLOT_COUNT 10
#define PCA9685_PWM_FREQ 50
// MG90S/MG996R 360° — หมุนด้วย SERVO_SPIN_US; หยุด = ตัด PWM (writeServoStop) ไม่ใช่ 1500μs
#define SERVO_STOP_US 1500
#define SERVO_SPIN_US 2000
#define SERVO_SPIN_US_REV 1200
#define SERVO_SPIN_MS 3000
#define SERVO_MAX_SPIN_MS 3500
#define SERVO_ALL_GAP_MS 400   // หน่วงระหว่างช่องตอน dispense_all

// PCA9685 OE — GPIO 11 + 10k pull-up to 3.3V (HIGH=disable PWM)
#define PCA9685_OE_PIN 11
#define ALLOW_DISPENSE_ALL 0
#define DISPENSER_IDLE_STOP_MS 30000

// 1 = หมุนช่อง 0 ตอน boot | 0 = ปิด (แนะนำเมื่อใช้งานจริง)
#define BOOT_SERVO_TEST 0

// ESP32-CAM MAC: 28:05:A5:24:16:AC (byte แรก = 0x28 ไม่ใช่ 0x2B)
#define CAM_ESPNOW_MAC {0x28, 0x05, 0xA5, 0x24, 0x16, 0xAC}
#define CAM_ESPNOW_PING_MS 10000
#define CAM_ESPNOW_TIMEOUT_MS 90000

#define CAM_MSG_PING "PING"
#define CAM_MSG_PONG "PONG"
#define CAM_MSG_SCAN "SCAN"
#define CAM_MSG_SCAN_STOP "SCAN_STOP"
#define CAM_MSG_OK "OK"
#define CAM_MSG_QR_PREFIX "QR:"
#define CAM_MSG_ERR_PREFIX "ERR:"
#define CAM_MSG_IP_PREFIX "IP:"
// ================================================

#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <WiFiClient.h>
#include <Wire.h>
#include <esp_now.h>
#include <esp_system.h>
#include <ArduinoJson.h>
#include "mbedtls/base64.h"
#include <Adafruit_PWMServoDriver.h>
#include "kiosk_page.h"

WebServer server(80);
Adafruit_PWMServoDriver pwm(PCA9685_I2C_ADDR);

unsigned long lastHeartbeatMs = 0;
unsigned long lastCameraFrameMs = 0;
unsigned long lastWifiRetryMs = 0;
bool pwmReady = false;
bool dispenseBusy = false;
bool pwmOutputsOn = false;
unsigned long lastIdleStopMs = 0;

uint8_t camPeerMac[6] = CAM_ESPNOW_MAC;
bool camOnline = false;
bool camPeerReady = false;
bool espNowStarted = false;
unsigned long lastCamRxMs = 0;
unsigned long lastCamPingMs = 0;
unsigned long lastScanMs = 0;
static char camPreviewUrl[48] = {};

enum KioskPhase : uint8_t {
  KIOSK_IDLE = 0,
  KIOSK_SCANNING,
  KIOSK_PREVIEW,
  KIOSK_DISPENSING,
  KIOSK_SUCCESS,
  KIOSK_ERROR,
};

static KioskPhase kioskPhase = KIOSK_IDLE;
static unsigned long kioskScanUntilMs = 0;
static unsigned long kioskSuccessAtMs = 0;
static unsigned long kioskErrorAtMs = 0;
static bool kioskCloudDirty = false;
static char kioskSessionError[96] = {};
static char kioskPreviewJson[2048] = {};
static char kioskPendingCode[32] = {};
static char kioskPendingSignature[128] = {};

static void kioskMarkCloudDirty() { kioskCloudDirty = true; }

const char* kioskPhaseName();
int kioskSessionCountdownSec();
bool camLinkOnline();
bool dispenserIsBusy();

static void kioskAppendCloudJson(JsonObject sessionOut) {
  sessionOut["phase"] = kioskPhaseName();
  sessionOut["countdownSec"] = kioskSessionCountdownSec();
  sessionOut["camOnline"] = camLinkOnline();
  sessionOut["dispenseBusy"] = dispenserIsBusy();
  if (kioskPhase == KIOSK_SCANNING) {
    const char* previewUrl = camLinkPreviewUrl();
    if (previewUrl && previewUrl[0]) {
      sessionOut["camPreviewUrl"] = previewUrl;
    }
  }
  const char* err = kioskSessionError;
  if (err && err[0] && kioskPhase == KIOSK_ERROR) {
    sessionOut["error"] = err;
  }
  if (kioskPreviewJson[0] && kioskPhase == KIOSK_PREVIEW) {
    JsonDocument previewDoc;
    if (!deserializeJson(previewDoc, kioskPreviewJson)) {
      sessionOut["preview"] = previewDoc.as<JsonObject>();
    }
  }
}

struct {
  bool pending = false;
  char id[40] = {};
  bool ok = true;
  char error[64] = {};
} pendingAck;

const char* wifiStatusText(wl_status_t s) {
  switch (s) {
    case WL_IDLE_STATUS: return "idle";
    case WL_NO_SSID_AVAIL: return "no SSID found";
    case WL_SCAN_COMPLETED: return "scan done";
    case WL_CONNECTED: return "connected";
    case WL_CONNECT_FAILED: return "wrong password";
    case WL_CONNECTION_LOST: return "connection lost";
    case WL_DISCONNECTED: return "disconnected";
    default: return "unknown";
  }
}

void camLinkStart();

bool pickupRedeemAndDispense(const char* code);

bool connectWiFi(unsigned long timeoutMs = 20000) {
  if (WiFi.status() == WL_CONNECTED) return true;

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.disconnect(true, true);
  delay(200);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.printf("[wifi] connecting to \"%s\"...\n", WIFI_SSID);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("[wifi] OK — IP %s  RSSI %d dBm\n",
                  WiFi.localIP().toString().c_str(), WiFi.RSSI());
    camLinkStart();
    return true;
  }

