PUNteerased/Khrong-ngan/hardware/esp32-s3-laneya-kiosk/arduino-ide/esp32-s3-laneya-kiosk/esp32-s3-laneya-kiosk.ino
  Serial.printf("[wifi] FAILED — status %d (%s)\n",
                WiFi.status(), wifiStatusText(WiFi.status()));
  return false;
}

void writeServoPulse(uint8_t channel, uint16_t pulseUs) {
  if (!pwmReady) return;
  const uint32_t tick = (pulseUs * 4096UL) / 20000UL;
  pwm.setPWM(channel, 0, tick);
  Serial.printf("[dispenser] ch=%u pulse=%uus tick=%lu\n", channel, pulseUs, tick);
}

// MG90S/MG996R 360° — หยุด = ตัด PWM (ไม่ส่ง 1500μs เพราะ 1500 = หมุน idle)
void writeServoStop(uint8_t channel) {
  if (!pwmReady) return;
  pwm.setPWM(channel, 0, 4096);
}

void stopAllServos() {
  if (!pwmReady) return;
  for (uint8_t ch = 0; ch < DISPENSER_SLOT_COUNT; ch++) {
    pwm.setPWM(ch, 0, 4096);
  }
}

void pwmOutputsEnable(bool enable) {
#if PCA9685_OE_PIN >= 0
  pinMode(PCA9685_OE_PIN, OUTPUT);
  digitalWrite(PCA9685_OE_PIN, enable ? LOW : HIGH);
  pwmOutputsOn = enable;
#else
  (void)enable;
  pwmOutputsOn = true;
#endif
}

void spinWaitMs(uint16_t durationMs) {
  const unsigned long deadline = millis() + durationMs;
  while ((long)(millis() - deadline) < 0) {
    yield();
    server.handleClient();
  }
}

class DispenseSlotGuard {
 public:
  explicit DispenseSlotGuard(uint8_t channel) : channel_(channel), active_(true) {
    dispenseBusy = true;
  }
  ~DispenseSlotGuard() {
    if (active_) {
      writeServoStop(channel_);
      dispenseBusy = false;
    }
  }
  DispenseSlotGuard(const DispenseSlotGuard&) = delete;
  DispenseSlotGuard& operator=(const DispenseSlotGuard&) = delete;

 private:
  uint8_t channel_;
  bool active_;
};

void dispenserPreBoot() {
#if PCA9685_OE_PIN >= 0
  pinMode(PCA9685_OE_PIN, OUTPUT);
  digitalWrite(PCA9685_OE_PIN, HIGH);
  pwmOutputsOn = false;
#endif
}

bool dispenserIsBusy() { return dispenseBusy; }
bool dispenserPwmReady() { return pwmReady; }
bool dispenserServoSafe() { return !dispenseBusy; }

bool probeI2cDevice(uint8_t addr) {
  Wire.beginTransmission(addr);
  return Wire.endTransmission() == 0;
}

void scanI2cBus() {
  Serial.println("[diag] I2C scan SDA=GPIO9 SCL=GPIO10:");
  uint8_t found = 0;
  for (uint8_t addr = 1; addr < 127; addr++) {
    Wire.beginTransmission(addr);
    if (Wire.endTransmission() == 0) {
      Serial.printf("[diag]   device 0x%02X\n", addr);
      found++;
    }
  }
  if (found == 0) {
    Serial.println("[diag]   NO devices — ตรวจ SDA/SCL/GND หรือ PCA9685 ไม่ได้ไฟ");
  }
}

void spinChannel(uint8_t slotIndex, uint16_t pulseUs, uint16_t durationMs) {
  Serial.printf("[diag] spin ch=%u pulse=%uus for %ums\n", slotIndex, pulseUs, durationMs);
  writeServoPulse(slotIndex, pulseUs);
  delay(durationMs);
  writeServoStop(slotIndex);
}

void runBootServoTest() {
  Serial.println("[diag] === BOOT SERVO TEST ch0 ===");
  Serial.println("[diag] ต้องมี: ไฟ 5V ที่ V+ ขั้วนอต PCA9685 + GND ร่วม + servo ช่อง 0");
  Serial.println("[diag] ถ้าไม่หมุน → ตรวจไฟ 5V V+ / OE→GPIO11+pull-up / servo");
  delay(1000);
  spinChannel(0, SERVO_SPIN_US, 1500);
  delay(500);
  spinChannel(0, SERVO_SPIN_US_REV, 1500);
  Serial.println("[diag] === BOOT TEST DONE ===");
}

void handleSerialDiag() {
  if (!Serial.available()) return;
  String line = Serial.readStringUntil('\n');
  line.trim();
  if (line.length() == 0) return;

  if (line == "scan") {
    scanI2cBus();
    return;
  }
  if (line == "test" || line == "test 0") {
    runBootServoTest();
    return;
  }
  if (line.startsWith("test ")) {
    const int ch = line.substring(5).toInt();
    if (ch < 0 || ch > 9) {
      Serial.println("[diag] usage: test 0..9");
      return;
    }
    spinChannel(static_cast<uint8_t>(ch), SERVO_SPIN_US, 1500);
    delay(500);
    spinChannel(static_cast<uint8_t>(ch), SERVO_SPIN_US_REV, 1500);
    return;
  }
  if (line.startsWith("pulse ")) {
    // pulse 0 1700 2000  → ช่อง pulseUs ระยะ ms
    const int sp1 = line.indexOf(' ');
    const int sp2 = line.indexOf(' ', sp1 + 1);
    const int sp3 = line.indexOf(' ', sp2 + 1);
    if (sp3 < 0) {
      Serial.println("[diag] usage: pulse <ch> <us> <ms>  e.g. pulse 0 1700 2000");
      return;
    }
    const int ch = line.substring(sp1 + 1, sp2).toInt();
    const int us = line.substring(sp2 + 1, sp3).toInt();
    const int ms = line.substring(sp3 + 1).toInt();
    if (ch < 0 || ch > 9 || us < 500 || us > 2500 || ms < 100 || ms > 10000) {
      Serial.println("[diag] invalid args");
      return;
    }
    spinChannel(static_cast<uint8_t>(ch), static_cast<uint16_t>(us), static_cast<uint16_t>(ms));
    return;
  }
  Serial.println("[diag] commands: scan | test | test 0..9 | pulse <ch> <us> <ms>");
}

void dispenserSetup() {
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Serial.printf("[dispenser] I2C SDA=GPIO%d SCL=GPIO%d slots=%d\n",
                I2C_SDA_PIN, I2C_SCL_PIN, DISPENSER_SLOT_COUNT);

#if PCA9685_OE_PIN >= 0
  Serial.printf("[dispenser] OE on GPIO%d (HIGH=disable PWM)\n", PCA9685_OE_PIN);
#endif

  scanI2cBus();
  if (!probeI2cDevice(PCA9685_I2C_ADDR)) {
    Serial.printf("[dispenser] ERROR: PCA9685 0x%02X not found on I2C!\n", PCA9685_I2C_ADDR);
    Serial.println("[dispenser] → ตรวจ SDA/SCL, ที่อยู่ A0-A5, ไฟ 3.3V VCC");
    pwmReady = false;
    return;
  }

  if (!pwm.begin()) {
    Serial.println("[dispenser] ERROR: pwm.begin() failed");
    pwmReady = false;
    return;
  }
  pwm.setOscillatorFrequency(27000000);
  pwm.setPWMFreq(PCA9685_PWM_FREQ);
  pwmReady = true;
  stopAllServos();
  pwmOutputsEnable(true);
  Serial.println("[dispenser] PCA9685 ready — all channels stopped");
  Serial.println("[dispenser] ⚠ servo ต้องมีไฟ 5V ที่ขั้ว V+ ของ PCA9685 (ไม่ใช่แค่ 3.3V logic)");
#if BOOT_SERVO_TEST
  runBootServoTest();
#endif
  lastIdleStopMs = millis();
}

void dispenserLoop() {
  if (dispenseBusy || !pwmReady) return;
  const unsigned long now = millis();
  if (now - lastIdleStopMs < DISPENSER_IDLE_STOP_MS) return;
  stopAllServos();
  lastIdleStopMs = now;
}

bool dispenserDispenseSlot(uint8_t slotIndex) {
  if (!pwmReady) {
    Serial.println("[dispenser] ERROR: PCA9685 not ready — ไม่หมุน servo");
    return false;
  }
  if (dispenseBusy) {
    Serial.println("[dispenser] rejected — dispense busy");
    return false;
  }
  if (slotIndex >= DISPENSER_SLOT_COUNT) return false;
  Serial.printf("[web-cmd] spinning PCA9685 channel %u\n", slotIndex);
  Serial.printf("[dispenser] spin slot %u\n", slotIndex);

