PUNteerased/Khrong-ngan/hardware/esp32-s3-laneya-kiosk/arduino-ide/esp32-s3-laneya-kiosk/esp32-s3-laneya-kiosk.ino
  DispenseSlotGuard guard(static_cast<uint8_t>(slotIndex));
  writeServoPulse(slotIndex, SERVO_SPIN_US);
  spinWaitMs(SERVO_SPIN_MS);
  return true;
}

bool dispenserDispenseAll() {
  if (!pwmReady) {
    Serial.println("[dispenser] ERROR: PCA9685 not ready — ไม่หมุน servo");
    return false;
  }
  if (dispenseBusy) {
    Serial.println("[dispenser] rejected — dispense busy");
    return false;
  }
  Serial.println("[web-cmd] dispense_all — spinning channels 0-9");
  bool allOk = true;
  for (uint8_t ch = 0; ch < DISPENSER_SLOT_COUNT; ch++) {
    if (!dispenserDispenseSlot(ch)) allOk = false;
    if (ch + 1 < DISPENSER_SLOT_COUNT) spinWaitMs(SERVO_ALL_GAP_MS);
  }
  Serial.printf("[web-cmd] dispense_all done ok=%s\n", allOk ? "true" : "false");
  return allOk;
}

static bool isPlaceholderMac(const uint8_t* mac) {
  return mac[0] == 0xFF && mac[1] == 0xFF && mac[2] == 0xFF &&
         mac[3] == 0xFF && mac[4] == 0xFF && mac[5] == 0xFF;
}

const char* kioskPhaseName() {
  switch (kioskPhase) {
    case KIOSK_SCANNING: return "scanning";
    case KIOSK_PREVIEW: return "preview";
    case KIOSK_DISPENSING: return "dispensing";
    case KIOSK_SUCCESS: return "success";
    case KIOSK_ERROR: return "error";
    default: return "idle";
  }
}

bool sendCamMessage(const char* msg);

bool camLinkPeerReady() { return camPeerReady; }

bool camLinkOnline() { return camOnline; }

const char* camLinkPreviewUrl() {
  return camPreviewUrl[0] ? camPreviewUrl : nullptr;
}

bool camLinkRequestScan() {
  for (int attempt = 0; attempt < 3; attempt++) {
    if (sendCamMessage(CAM_MSG_SCAN)) return true;
    delay(50);
  }
  Serial.println("[cam] SCAN send failed after retries");
  return false;
}

void camLinkRequestScanStop() {
  sendCamMessage(CAM_MSG_SCAN_STOP);
}

void kioskSessionReset() {
  kioskPhase = KIOSK_IDLE;
  kioskScanUntilMs = 0;
  kioskSessionError[0] = '\0';
  kioskPreviewJson[0] = '\0';
  kioskPendingCode[0] = '\0';
  kioskPendingSignature[0] = '\0';
  camLinkRequestScanStop();
  kioskMarkCloudDirty();
}

static void mapHttpError(int status, String& errorOut) {
  switch (status) {
    case 401:
      errorOut = "unauthorized";
      break;
    case 404:
      errorOut = "ticket not found";
      break;
    case 410:
      errorOut = "ticket expired";
      break;
    default:
      errorOut = "preview failed";
      break;
  }
}

bool postKioskTicketUrl(
    const char* url,
    const char* code,
    const char* signature,
    String& response,
    String& errorOut) {
  if (WiFi.status() != WL_CONNECTED || !code || !code[0]) {
    errorOut = "preview failed";
    return false;
  }
  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  http.begin(client, url);
  http.setTimeout(30000);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Kiosk-Secret", KIOSK_HEARTBEAT_SECRET);
  JsonDocument doc;
  doc["code"] = code;
  if (signature && signature[0]) doc["signature"] = signature;
  String body;
  serializeJson(doc, body);
  const int status = http.POST(body);
  response = http.getString();
  if (status < 200 || status >= 300) {
    Serial.printf("[pickup] HTTP %d (%s) body=%s\n", status, url, response.c_str());
    http.end();
    mapHttpError(status, errorOut);
    return false;
  }
  http.end();
  return true;
}

bool pickupPreviewTicket(
    const char* code,
    const char* signature,
    String& outJson,
    String& errorOut) {
  errorOut = "";
  String response;
  if (!postKioskTicketUrl(BACKEND_PREVIEW_URL, code, signature, response, errorOut)) {
    if (errorOut.length() == 0) errorOut = "preview failed";
    return false;
  }
  JsonDocument res;
  if (deserializeJson(res, response)) {
    errorOut = "preview failed";
    return false;
  }
  if (!res["ok"].as<bool>()) {
    const char* err = res["error"] | "preview failed";
    errorOut = err;
    return false;
  }
  outJson = response;
  return true;
}

bool kioskSessionOnQrCode(const char* code, const char* signature) {
  if (!code || !code[0]) return false;
  if (kioskPhase != KIOSK_SCANNING && kioskPhase != KIOSK_PREVIEW) return false;
  strncpy(kioskPendingCode, code, sizeof(kioskPendingCode) - 1);
  kioskPendingCode[sizeof(kioskPendingCode) - 1] = '\0';
  if (signature && signature[0]) {
    strncpy(kioskPendingSignature, signature, sizeof(kioskPendingSignature) - 1);
    kioskPendingSignature[sizeof(kioskPendingSignature) - 1] = '\0';
  } else {
    kioskPendingSignature[0] = '\0';
  }
  String previewBody;
  String previewError;
  if (!pickupPreviewTicket(
          kioskPendingCode,
          kioskPendingSignature[0] ? kioskPendingSignature : nullptr,
          previewBody,
          previewError)) {
    kioskPhase = KIOSK_ERROR;
    const char* err = previewError.length() ? previewError.c_str() : "preview failed";
    strncpy(kioskSessionError, err, sizeof(kioskSessionError) - 1);
    kioskSessionError[sizeof(kioskSessionError) - 1] = '\0';
    camLinkRequestScanStop();
    kioskMarkCloudDirty();
    return false;
  }
  if (previewBody.length() >= sizeof(kioskPreviewJson)) {
    kioskPhase = KIOSK_ERROR;
    strncpy(kioskSessionError, "preview too large", sizeof(kioskSessionError) - 1);
    kioskSessionError[sizeof(kioskSessionError) - 1] = '\0';
    kioskMarkCloudDirty();
    return false;
  }
  strncpy(kioskPreviewJson, previewBody.c_str(), sizeof(kioskPreviewJson) - 1);
  kioskPreviewJson[sizeof(kioskPreviewJson) - 1] = '\0';
  kioskPhase = KIOSK_PREVIEW;
  kioskScanUntilMs = 0;
  camLinkRequestScanStop();
  kioskMarkCloudDirty();
  return true;
}

void kioskSessionOnScanError(const char* msg) {
  if (kioskPhase != KIOSK_SCANNING) return;
  kioskPhase = KIOSK_ERROR;
  kioskScanUntilMs = 0;
  if (msg && msg[0] && strcmp(msg, "timeout") == 0) {
    strncpy(kioskSessionError, "scan timeout", sizeof(kioskSessionError) - 1);
  } else if (msg && msg[0]) {
    strncpy(kioskSessionError, msg, sizeof(kioskSessionError) - 1);
  } else {
    strncpy(kioskSessionError, "scan timeout", sizeof(kioskSessionError) - 1);
  }
  kioskSessionError[sizeof(kioskSessionError) - 1] = '\0';
  camLinkRequestScanStop();
  Serial.printf("[kiosk] scan error: %s\n", kioskSessionError);
  kioskMarkCloudDirty();
}

bool kioskSessionStartScan() {
  if (kioskPhase == KIOSK_DISPENSING) return false;
  kioskSessionError[0] = '\0';
  kioskPreviewJson[0] = '\0';
  kioskPendingCode[0] = '\0';
  kioskPendingSignature[0] = '\0';
  if (!camLinkRequestScan()) return false;
  kioskPhase = KIOSK_SCANNING;
  kioskScanUntilMs = millis() + 45000;
  Serial.println("[kiosk] scan started (45s)");
  kioskMarkCloudDirty();
  return true;
}

void kioskSessionCancelScan() {
  kioskSessionReset();
  kioskMarkCloudDirty();
}

bool kioskSessionConfirmPickup() {
  if (kioskPhase != KIOSK_PREVIEW || !kioskPendingCode[0]) return false;
  if (dispenserIsBusy()) {
    Serial.println("[kiosk] confirm rejected — dispense busy");
    return false;
  }
  kioskPhase = KIOSK_DISPENSING;
  kioskMarkCloudDirty();
  const bool ok = pickupRedeemAndDispense(kioskPendingCode);
  if (ok) {
    kioskPhase = KIOSK_SUCCESS;
    kioskPreviewJson[0] = '\0';
    kioskPendingCode[0] = '\0';
    kioskMarkCloudDirty();
    return true;
  }
  kioskPhase = KIOSK_ERROR;
  strncpy(kioskSessionError, "dispense failed", sizeof(kioskSessionError) - 1);
  kioskMarkCloudDirty();
  return false;
}

void kioskSessionLoop() {
  if (kioskPhase == KIOSK_SCANNING && kioskScanUntilMs > 0 && millis() > kioskScanUntilMs) {
    kioskSessionOnScanError("timeout");
    Serial.println("[kiosk] scan timeout");
  }
  if (kioskPhase == KIOSK_SUCCESS) {
    if (kioskSuccessAtMs == 0) kioskSuccessAtMs = millis();
    if (millis() - kioskSuccessAtMs > 3000) {
      kioskSuccessAtMs = 0;
      kioskSessionReset();
    }
  } else {
    kioskSuccessAtMs = 0;
  }
  if (kioskPhase == KIOSK_ERROR) {
    if (kioskErrorAtMs == 0) kioskErrorAtMs = millis();
    if (millis() - kioskErrorAtMs > 8000) {
      kioskErrorAtMs = 0;
      kioskSessionReset();
      Serial.println("[kiosk] error cleared → idle");
    }
  } else {
    kioskErrorAtMs = 0;
  }
}

int kioskSessionCountdownSec() {
  if (kioskPhase != KIOSK_SCANNING || kioskScanUntilMs == 0) return 0;
  const long ms = static_cast<long>(kioskScanUntilMs - millis());
  return ms <= 0 ? 0 : static_cast<int>((ms + 999) / 1000);
}

bool pickupRedeemAndDispense(const char* code) {
  String response;
  String errorOut;
  if (!postKioskTicketUrl(BACKEND_REDEEM_URL, code, nullptr, response, errorOut)) {
    Serial.println("[pickup] redeem failed");
    return false;
  }

  JsonDocument res;
  if (deserializeJson(res, response)) {
    Serial.println("[pickup] invalid redeem JSON");
    return false;
  }

  if (!res["ok"].as<bool>()) {
    Serial.println("[pickup] redeem not ok");
    return false;
  }

  const int channel = res["channel"] | -1;
  const char* slotId = res["slotId"] | "?";
  if (channel < 0 || channel > 9) {
    Serial.println("[pickup] invalid channel");
    return false;
  }

  Serial.printf("[pickup] redeem ok slot=%s ch=%d — dispense\n", slotId, channel);
  const bool ok = dispenserDispenseSlot(static_cast<uint8_t>(channel));
  Serial.printf("[pickup] dispense %s\n", ok ? "ok" : "fail");
  return ok;
}

