PUNteerased/Khrong-ngan/hardware/esp32-s3-laneya-kiosk/arduino-ide/esp32-s3-laneya-kiosk/esp32-s3-laneya-kiosk.ino
static void handleCamPayload(const uint8_t* data, int len) {
  if (len <= 0) return;
  char buf[251];
  const int n = len < 250 ? len : 250;
  memcpy(buf, data, n);
  buf[n] = '\0';

  if (strcmp(buf, CAM_MSG_PONG) == 0 || strcmp(buf, CAM_MSG_OK) == 0) {
    camOnline = true;
    lastCamRxMs = millis();
  } else if (strncmp(buf, CAM_MSG_QR_PREFIX, strlen(CAM_MSG_QR_PREFIX)) == 0) {
    camOnline = true;
    lastCamRxMs = millis();
    const char* payload = buf + strlen(CAM_MSG_QR_PREFIX);
    if (payload[0] == '{') {
      JsonDocument qrDoc;
      if (!deserializeJson(qrDoc, payload)) {
        const char* code = qrDoc["code"] | "";
        const char* signature = qrDoc["signature"] | qrDoc["sig"] | "";
        if (code[0]) kioskSessionOnQrCode(code, signature[0] ? signature : nullptr);
      }
    } else if (payload[0]) {
      kioskSessionOnQrCode(payload, nullptr);
    }
  } else if (strncmp(buf, CAM_MSG_ERR_PREFIX, strlen(CAM_MSG_ERR_PREFIX)) == 0) {
    camOnline = true;
    lastCamRxMs = millis();
    kioskSessionOnScanError(buf + strlen(CAM_MSG_ERR_PREFIX));
  } else if (strncmp(buf, CAM_MSG_IP_PREFIX, strlen(CAM_MSG_IP_PREFIX)) == 0) {
    camOnline = true;
    lastCamRxMs = millis();
    const char* ip = buf + strlen(CAM_MSG_IP_PREFIX);
    snprintf(camPreviewUrl, sizeof(camPreviewUrl), "http://%s:81/jpg", ip);
    Serial.printf("[cam] preview url %s\n", camPreviewUrl);
  }
  Serial.printf("[cam] ESP-NOW << %s\n", buf);
}

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void onCamEspNowRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  (void)info;
  handleCamPayload(data, len);
}
#else
void onCamEspNowRecv(const uint8_t* mac, const uint8_t* data, int len) {
  (void)mac;
  handleCamPayload(data, len);
}
#endif

bool addCamPeer() {
  if (isPlaceholderMac(camPeerMac)) {
    Serial.println("[cam] ตั้ง CAM_ESPNOW_MAC จาก MAC บน Serial ของ ESP32-CAM");
    return false;
  }

  const uint8_t ch = (WiFi.status() == WL_CONNECTED) ? WiFi.channel() : 1;

  if (esp_now_is_peer_exist(camPeerMac)) {
    esp_now_peer_info_t existing = {};
    if (esp_now_get_peer(camPeerMac, &existing) == ESP_OK && existing.channel == ch) {
      camPeerReady = true;
      return true;
    }
    esp_now_del_peer(camPeerMac);
    Serial.printf("[cam] peer channel changed → re-add ch=%d\n", ch);
  }

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, camPeerMac, 6);
  peer.channel = ch;
  peer.encrypt = false;
  peer.ifidx = WIFI_IF_STA;

  if (esp_now_add_peer(&peer) != ESP_OK) {
    Serial.println("[cam] esp_now_add_peer failed");
    camPeerReady = false;
    return false;
  }

  camPeerReady = true;
  Serial.printf("[cam] peer CAM %02X:%02X:%02X:%02X:%02X:%02X ch=%d\n",
                camPeerMac[0], camPeerMac[1], camPeerMac[2],
                camPeerMac[3], camPeerMac[4], camPeerMac[5], peer.channel);
  return true;
}

bool sendCamMessage(const char* msg) {
  if (!espNowStarted || !camPeerReady || !msg || !msg[0]) return false;
  const esp_err_t err =
      esp_now_send(camPeerMac, reinterpret_cast<const uint8_t*>(msg), strlen(msg));
  Serial.printf("[cam] ESP-NOW >> %s (%s)\n", msg, err == ESP_OK ? "ok" : "fail");
  return err == ESP_OK;
}

void camLinkStart() {
  if (espNowStarted) {
    esp_now_deinit();
    espNowStarted = false;
    camPeerReady = false;
    camOnline = false;
  }

  if (esp_now_init() != ESP_OK) {
    Serial.println("[cam] esp_now_init failed");
    return;
  }

  esp_now_register_recv_cb(onCamEspNowRecv);
  espNowStarted = true;

  if (addCamPeer()) {
    sendCamMessage(CAM_MSG_PING);
    lastCamPingMs = millis();
  }
}

void camLinkSetup() {
  Serial.printf("[cam] S3 MAC %s\n", WiFi.macAddress().c_str());
  camLinkStart();
}

void camLinkLoop() {
  const unsigned long now = millis();

  if (!camPeerReady && !isPlaceholderMac(camPeerMac)) {
    addCamPeer();
  }

  if (camPeerReady && now - lastCamPingMs >= CAM_ESPNOW_PING_MS) {
    sendCamMessage(CAM_MSG_PING);
    lastCamPingMs = now;
  }

  if (camOnline && now - lastCamRxMs > CAM_ESPNOW_TIMEOUT_MS) {
    camOnline = false;
  }
}

void queueAck(const char* id, bool ok, const char* errMsg = nullptr) {
  pendingAck.pending = true;
  strncpy(pendingAck.id, id, sizeof(pendingAck.id) - 1);
  pendingAck.ok = ok;
  if (errMsg && errMsg[0]) {
    strncpy(pendingAck.error, errMsg, sizeof(pendingAck.error) - 1);
  } else {
    pendingAck.error[0] = '\0';
  }
  Serial.printf("[web-cmd] done %s — ack queued id=%s\n", ok ? "ok" : "fail", id);
}

String buildHeartbeatBody() {
  JsonDocument doc;
  doc["online"] = true;
  doc["lat"] = KIOSK_LAT;
  doc["lng"] = KIOSK_LNG;
  doc["name"] = KIOSK_NAME;
  doc["device"] = "esp32-s3";
  doc["firmwareVersion"] = FIRMWARE_VERSION;
  doc["rssi"] = WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0;

  JsonObject session = doc["session"].to<JsonObject>();
  kioskAppendCloudJson(session);

  if (pendingAck.pending) {
    JsonObject ack = doc["commandAck"].to<JsonObject>();
    ack["id"] = pendingAck.id;
    ack["ok"] = pendingAck.ok;
    if (pendingAck.error[0]) {
      ack["error"] = pendingAck.error;
    }
    Serial.printf("[web-cmd] ack sent id=%s ok=%s\n",
                  pendingAck.id, pendingAck.ok ? "true" : "false");
    pendingAck.pending = false;
  }

  String out;
  serializeJson(doc, out);
  return out;
}

String buildSessionSyncBody() {
  JsonDocument doc;
  JsonObject session = doc["session"].to<JsonObject>();
  kioskAppendCloudJson(session);
  String out;
  serializeJson(doc, out);
  return out;
}

bool postCloudJson(const char* url, const String& body) {
  if (WiFi.status() != WL_CONNECTED) return false;
  if (strlen(KIOSK_HEARTBEAT_SECRET) == 0) return false;
  if (!url || !url[0]) return false;

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  http.begin(client, url);
  http.setTimeout(20000);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Kiosk-Secret", KIOSK_HEARTBEAT_SECRET);
  const int code = http.POST(body);
  const bool ok = code >= 200 && code < 300;
  if (!ok && code > 0) {
    Serial.printf("[cloud-sync] HTTP %d (%s)\n", code, url);
  }
  http.end();
  return ok;
}

