PUNteerased/Khrong-ngan/hardware/esp32-s3-laneya-kiosk/arduino-ide/esp32-s3-laneya-kiosk/esp32-s3-laneya-kiosk.ino
bool encodeJpegBase64(const uint8_t* data, size_t len, String& out) {
  if (!data || len == 0) return false;
  size_t olen = 0;
  if (mbedtls_base64_encode(nullptr, 0, &olen, data, len) != MBEDTLS_ERR_BASE64_BUFFER_TOO_SMALL) {
    return false;
  }
  unsigned char* buf = new unsigned char[olen + 1];
  const bool ok =
      mbedtls_base64_encode(buf, olen + 1, &olen, data, len) == 0;
  if (ok) {
    out = String(reinterpret_cast<const char*>(buf), olen);
  }
  delete[] buf;
  return ok;
}

void relayCameraFrameIfScanning() {
  if (kioskPhase != KIOSK_SCANNING) return;
  if (millis() - lastCameraFrameMs < CAMERA_FRAME_INTERVAL_MS) return;

  const char* previewUrl = camLinkPreviewUrl();
  if (!previewUrl || !previewUrl[0]) return;
  if (WiFi.status() != WL_CONNECTED) return;
  if (strlen(BACKEND_CAMERA_FRAME_URL) == 0) return;
  if (strlen(KIOSK_HEARTBEAT_SECRET) == 0) return;

  lastCameraFrameMs = millis();

  WiFiClient camClient;
  HTTPClient camHttp;
  camHttp.begin(camClient, previewUrl);
  camHttp.setTimeout(4000);
  const int camCode = camHttp.GET();
  if (camCode != HTTP_CODE_OK) {
    camHttp.end();
    return;
  }

  const String jpeg = camHttp.getString();
  camHttp.end();

  if (jpeg.length() < 100 || jpeg.length() > 512000) return;

  String b64;
  if (!encodeJpegBase64(reinterpret_cast<const uint8_t*>(jpeg.c_str()), jpeg.length(), b64)) {
    return;
  }

  JsonDocument doc;
  doc["jpegBase64"] = b64;
  String body;
  serializeJson(doc, body);
  postCloudJson(BACKEND_CAMERA_FRAME_URL, body);
}

void pushSessionSyncIfDirty() {
  if (!kioskCloudDirty) return;
  const String body = buildSessionSyncBody();
  if (postCloudJson(BACKEND_SESSION_SYNC_URL, body)) {
    kioskCloudDirty = false;
    Serial.println("[cloud-sync] session pushed");
  }
}

void sendHeartbeat();

void handleDisplayCommand(const char* id, const char* action) {
  bool ok = false;
  const char* errMsg = nullptr;

  if (strcmp(action, "scan_start") == 0) {
    Serial.printf("[web-cmd] received scan_start id=%s\n", id);
    ok = kioskSessionStartScan();
    if (!ok) errMsg = "scan start failed";
  } else if (strcmp(action, "scan_cancel") == 0) {
    Serial.printf("[web-cmd] received scan_cancel id=%s\n", id);
    kioskSessionCancelScan();
    ok = true;
  } else if (strcmp(action, "confirm_pickup") == 0) {
    Serial.printf("[web-cmd] received confirm_pickup id=%s\n", id);
    ok = kioskSessionConfirmPickup();
    if (!ok) errMsg = "confirm failed";
  } else {
    Serial.println("[web-cmd] ignored invalid command");
    return;
  }

  queueAck(id, ok, ok ? nullptr : errMsg);
  pushSessionSyncIfDirty();
  sendHeartbeat();
  lastHeartbeatMs = millis();
}

void handleCommandFromResponse(const String& response) {
  JsonDocument doc;
  if (deserializeJson(doc, response)) {
    Serial.println("[heartbeat] invalid JSON response");
    return;
  }

  JsonObject cmd = doc["command"];
  if (cmd.isNull()) return;

  const char* id = cmd["id"] | "";
  const char* action = cmd["action"] | "";
  const int slot = cmd["slot"] | -1;

  if (!id[0]) {
    Serial.println("[web-cmd] ignored invalid command");
    return;
  }

  if (strcmp(action, "scan_start") == 0 ||
      strcmp(action, "scan_cancel") == 0 ||
      strcmp(action, "confirm_pickup") == 0) {
    if (dispenserIsBusy() && strcmp(action, "scan_cancel") != 0 &&
        strcmp(action, "confirm_pickup") != 0) {
      Serial.println("[web-cmd] rejected — dispense busy");
      queueAck(id, false, "busy");
      sendHeartbeat();
      lastHeartbeatMs = millis();
      return;
    }
    handleDisplayCommand(id, action);
    return;
  }

  if (dispenserIsBusy()) {
    Serial.println("[web-cmd] rejected — dispense busy");
    queueAck(id, false, "busy");
    sendHeartbeat();
    lastHeartbeatMs = millis();
    return;
  }

  bool ok = false;
  if (strcmp(action, "dispense_all") == 0) {
#if !ALLOW_DISPENSE_ALL
    Serial.println("[web-cmd] rejected dispense_all (disabled in production)");
    queueAck(id, false, "dispense_all disabled");
    sendHeartbeat();
    lastHeartbeatMs = millis();
    return;
#else
    Serial.printf("[web-cmd] received dispense_all id=%s\n", id);
    ok = dispenserDispenseAll();
#endif
  } else if (strcmp(action, "dispense") == 0 && slot >= 0 && slot <= 9) {
    Serial.printf("[web-cmd] received dispense slot=%d id=%s\n", slot, id);
    ok = dispenserDispenseSlot(static_cast<uint8_t>(slot));
  } else {
    Serial.println("[web-cmd] ignored invalid command");
    return;
  }

  queueAck(id, ok, ok ? nullptr : "dispense failed");
  sendHeartbeat();
  lastHeartbeatMs = millis();
}

void sendCorsHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type, X-Kiosk-Secret");
}

void handleKioskPage() {
  server.send_P(200, "text/html; charset=utf-8", KIOSK_PAGE_HTML);
}

void handleHealth() {
  sendCorsHeaders();
  server.send(200, "application/json", "{\"ok\":true,\"device\":\"esp32-s3\"}");
}

void handleStatus() {
  sendCorsHeaders();
  JsonDocument doc;
  doc["online"] = WiFi.status() == WL_CONNECTED;
  doc["lat"] = KIOSK_LAT;
  doc["lng"] = KIOSK_LNG;
  doc["name"] = KIOSK_NAME;
  doc["device"] = "esp32-s3";
  doc["firmwareVersion"] = FIRMWARE_VERSION;
  doc["rssi"] = WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0;
  doc["camOnline"] = camOnline;
  doc["phase"] = kioskPhaseName();
  doc["dispenseBusy"] = dispenserIsBusy();
  doc["pwmReady"] = dispenserPwmReady();
  doc["servoSafe"] = dispenserServoSafe();
  String out;
  serializeJson(doc, out);
  server.send(200, "application/json", out);
}

void handleKioskSession() {
  sendCorsHeaders();
  JsonDocument doc;
  doc["phase"] = kioskPhaseName();
  doc["countdownSec"] = kioskSessionCountdownSec();
  doc["camOnline"] = camOnline;
  doc["dispenseBusy"] = dispenserIsBusy();
  doc["pwmReady"] = dispenserPwmReady();
  doc["servoSafe"] = dispenserServoSafe();
  const char* previewUrl = camLinkPreviewUrl();
  if (previewUrl && previewUrl[0] && kioskPhase == KIOSK_SCANNING) {
    doc["camPreviewUrl"] = previewUrl;
  }
  if (kioskSessionError[0]) doc["error"] = kioskSessionError;
  if (kioskPreviewJson[0]) {
    JsonDocument previewDoc;
    if (!deserializeJson(previewDoc, kioskPreviewJson)) {
      doc["preview"] = previewDoc.as<JsonObject>();
    }
  }
  String out;
  serializeJson(doc, out);
  server.send(200, "application/json", out);
}

void handleScanStart() {
  sendCorsHeaders();
  if (!camLinkPeerReady()) {
    server.send(503, "application/json", "{\"error\":\"cam peer not ready\"}");
    return;
  }
  if (!camLinkOnline()) {
    Serial.println("[kiosk] scan start — cam not pinged yet, trying SCAN anyway");
  }
  if (!kioskSessionStartScan()) {
    server.send(503, "application/json", "{\"error\":\"scan start failed\"}");
    return;
  }
  server.send(200, "application/json", "{\"ok\":true,\"phase\":\"scanning\"}");
}

void handleScanCancel() {
  sendCorsHeaders();
  kioskSessionCancelScan();
  server.send(200, "application/json", "{\"ok\":true,\"phase\":\"idle\"}");
}

void handlePickupConfirm() {
  sendCorsHeaders();
  if (dispenserIsBusy()) {
    server.send(409, "application/json", "{\"ok\":false,\"error\":\"dispense busy\"}");
    return;
  }
  if (kioskSessionConfirmPickup()) {
    server.send(200, "application/json", "{\"ok\":true,\"phase\":\"success\"}");
  } else {
    server.send(500, "application/json", "{\"ok\":false,\"error\":\"confirm failed\"}");
  }
}

void handleOptions() {
  sendCorsHeaders();
  server.send(204);
}

bool authorizeKioskRequest() {
  if (strlen(KIOSK_HEARTBEAT_SECRET) == 0) return false;
  return server.header("X-Kiosk-Secret") == KIOSK_HEARTBEAT_SECRET;
}

void handleDispense() {
  sendCorsHeaders();
  if (!authorizeKioskRequest()) {
    server.send(401, "application/json", "{\"error\":\"Unauthorized\"}");
    return;
  }
  if (dispenserIsBusy()) {
    server.send(409, "application/json", "{\"error\":\"dispense busy\"}");
    return;
  }

  JsonDocument doc;
  if (deserializeJson(doc, server.arg("plain"))) {
    server.send(400, "application/json", "{\"error\":\"invalid json\"}");
    return;
  }

