PUNteerased/Khrong-ngan/hardware/esp32-s3-laneya-kiosk/arduino-ide/esp32-s3-laneya-kiosk/esp32-s3-laneya-kiosk.ino
  const int slot = doc["slot"] | -1;
  if (slot < 0 || slot > 9) {
    server.send(400, "application/json", "{\"error\":\"invalid slot\"}");
    return;
  }

  Serial.printf("[web-cmd] LAN POST /dispense slot=%d\n", slot);
  const bool ok = dispenserDispenseSlot(static_cast<uint8_t>(slot));
  if (ok) {
    server.send(200, "application/json", "{\"ok\":true,\"slot\":" + String(slot) + "}");
  } else {
    server.send(500, "application/json", "{\"error\":\"dispense failed\"}");
  }
}

void sendHeartbeat() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (strlen(KIOSK_HEARTBEAT_SECRET) == 0) return;

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.begin(client, BACKEND_HEARTBEAT_URL);
  http.setTimeout(45000);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Kiosk-Secret", KIOSK_HEARTBEAT_SECRET);

  const String body = buildHeartbeatBody();
  const int code = http.POST(body);

  if (code >= 200 && code < 300) {
    const String response = http.getString();
    Serial.printf("[heartbeat] HTTP %d\n", code);
    handleCommandFromResponse(response);
  } else if (code > 0) {
    Serial.printf("[heartbeat] HTTP %d\n", code);
  } else {
    Serial.printf("[heartbeat] error %d (%s)\n", code, http.errorToString(code).c_str());
  }
  http.end();
}

void setup() {
  dispenserPreBoot();
  dispenserSetup();

  Serial.begin(115200);
  delay(100);
  const esp_reset_reason_t reason = esp_reset_reason();
  const char* reasonText = "unknown";
  switch (reason) {
    case ESP_RST_POWERON: reasonText = "power_on"; break;
    case ESP_RST_EXT: reasonText = "external"; break;
    case ESP_RST_SW: reasonText = "software"; break;
    case ESP_RST_PANIC: reasonText = "panic"; break;
    case ESP_RST_INT_WDT: reasonText = "int_wdt"; break;
    case ESP_RST_TASK_WDT: reasonText = "task_wdt"; break;
    case ESP_RST_WDT: reasonText = "wdt"; break;
    case ESP_RST_BROWNOUT: reasonText = "brownout"; break;
    default: break;
  }
  Serial.printf("[boot] reset reason: %s\n", reasonText);
  Serial.println("[boot] LaneYa ESP32-S3 Kiosk (web-cmd + PCA9685 + ESP-NOW)");

  connectWiFi();
  Serial.printf("[cam] S3 MAC %s\n", WiFi.macAddress().c_str());
  if (!espNowStarted) {
    camLinkStart();
  }

  server.on("/kiosk", HTTP_GET, handleKioskPage);
  server.on("/kiosk/", HTTP_GET, handleKioskPage);
  server.on("/health", HTTP_GET, handleHealth);
  server.on("/status", HTTP_GET, handleStatus);
  server.on("/kiosk/session", HTTP_GET, handleKioskSession);
  server.on("/kiosk/scan/start", HTTP_POST, handleScanStart);
  server.on("/kiosk/scan/cancel", HTTP_POST, handleScanCancel);
  server.on("/kiosk/scan/cancel", HTTP_GET, handleScanCancel);
  server.on("/kiosk/pickup/confirm", HTTP_POST, handlePickupConfirm);
  server.on("/kiosk/session", HTTP_OPTIONS, handleOptions);
  server.on("/kiosk/scan/start", HTTP_OPTIONS, handleOptions);
  server.on("/kiosk/scan/cancel", HTTP_OPTIONS, handleOptions);
  server.on("/kiosk/pickup/confirm", HTTP_OPTIONS, handleOptions);
  server.on("/dispense", HTTP_POST, handleDispense);
  server.onNotFound([]() {
    sendCorsHeaders();
    server.send(404, "application/json", "{\"error\":\"not found\"}");
  });
  server.begin();
  Serial.println("[http] /kiosk /health /status /kiosk/* on port 80");
  Serial.println("[diag] Serial commands: scan | test | test 0..9 | pulse <ch> <us> <ms>");

  sendHeartbeat();
  lastHeartbeatMs = millis();
}

void loop() {
  server.handleClient();
  handleSerialDiag();
  camLinkLoop();
  kioskSessionLoop();
  dispenserLoop();

  if (WiFi.status() != WL_CONNECTED &&
      millis() - lastWifiRetryMs >= 15000) {
    connectWiFi(15000);
    lastWifiRetryMs = millis();
  }

  pushSessionSyncIfDirty();
  relayCameraFrameIfScanning();

  unsigned long hbInterval = HEARTBEAT_INTERVAL_MS;
  if (kioskPhase != KIOSK_IDLE) {
    hbInterval = HEARTBEAT_ACTIVE_INTERVAL_MS;
  }

  if (millis() - lastHeartbeatMs >= hbInterval) {
    sendHeartbeat();
    lastHeartbeatMs = millis();
  }
}
